---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeDiameterParam
source: html/2a565105-5469-50f6-8b6b-74ee710e1293.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeDiameterParam Property

"Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeDiameterParam { get; }
```